STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251axx_cm33.h
#define LTDC_S                              ((LTDC_TypeDef *) LTDC_BASE_S)
#define LTDC_Layer1_S                       ((LTDC_Layer_TypeDef *) LTDC_Layer1_BASE_S)
#define LTDC_Layer2_S                       ((LTDC_Layer_TypeDef *) LTDC_Layer2_BASE_S)
#define LTDC_Layer3_S                       ((LTDC_Layer_TypeDef *) LTDC_Layer3_BASE_S)
#define CSI_S                               ((CSI_TypeDef *) CSI_BASE_S)
#define DCMIPP_S                            ((DCMIPP_TypeDef *) DCMIPP_BASE_S)
#define DDRC_S                              ((DDRC_TypeDef *) DDRC_BASE_S)
#define DDRDBG_S                            ((DDRDBG_TypeDef *) DDRDBG_BASE_S)
#define DDRPERFM_S                          ((DDRPERFM_TypeDef *) DDRPERFM_BASE_S)
#define STGENC_S                            ((STGENC_TypeDef *) STGENC_BASE_S)
#define STGENR_S                            ((STGENR_TypeDef *) STGENR_BASE_S)
#define GICV2M_S                            ((GICV2M_TypeDef *) GICV2M_BASE_S)
#define UCPD1_S                             ((UCPD_TypeDef *) UCPD1_BASE_S)
#define FMC_Bank1_R_S                       ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_S)
#define FMC_Bank1E_R_S                      ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_S)
#define FMC_Bank3_R_S                       ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_S)
#define FMC_Common_R_S                      ((FMC_Common_TypeDef *) FMC_Common_R_BASE_S)
#define SDMMC1_S                            ((SDMMC_TypeDef *) SDMMC1_BASE_S)
#define SDMMC2_S                            ((SDMMC_TypeDef *) SDMMC2_BASE_S)
#define SDMMC3_S                            ((SDMMC_TypeDef *) SDMMC3_BASE_S)
#define ETH1_S                              ((ETH_TypeDef *) ETH1_BASE_S)
#define USBH_OHCI_S                         ((USBH_OHCI_TypeDef *) USBH_OHCI_BASE_S)
#define USBH_EHCI_S                         ((USBH_EHCI_TypeDef *) USBH_EHCI_BASE_S)
#define USB3_S                              ((USB3_TypeDef *) USB3DRD_BASE_S)
#define CA35SYSCFG_S                        ((CA35SYSCFG_TypeDef *) CA35SYSCFG_BASE_S)

#define DBGMCU_S                            ((DBGMCU_TypeDef *) DBGMCU_BASE_S)
#endif /*  CORTEX_IN_SECURE_STATE */
/*!< Memory & Instance default aliases */
#if defined (CORTEX_IN_SECURE_STATE)
/*!< Peripherals base addresses defaults to Secure aliases */
#define PERIPH_BASE                 PERIPH_BASE_S

/*!< Memory base addresses defaults to Secure aliases */
#define SRAMS_BASE                  SRAMS_BASE_S

#define SYSRAM_BASE                 SYSRAM_BASE_S
#define SRAM1_BASE                  SRAM1_BASE_S
#define SRAM2_BASE                  SRAM2_BASE_S
#define RETRAM_BASE                 RETRAM_BASE_S
#define VDERAM_BASE                 VDERAM_BASE_S
#define LPSRAM1_BASE                LPSRAM1_BASE_S
#define LPSRAM2_BASE                LPSRAM2_BASE_S
#define LPSRAM3_BASE                LPSRAM3_BASE_S

#define BKP_SRAM_BASE               BKP_SRAM_BASE_S
#define CAN_SRAM_BASE               CAN_SRAM_BASE_S

#define SRAMS_FETCH_BASE            SRAMS_FETCH_BASE_S

/*!< APB1 peripherals defaults to Secure aliases */
#define TIM2                        TIM2_S
#define TIM2_BASE                   TIM2_BASE_S

#define TIM3                        TIM3_S
#define TIM3_BASE                   TIM3_BASE_S

#define TIM4                        TIM4_S
#define TIM4_BASE                   TIM4_BASE_S

#define TIM5                        TIM5_S
#define TIM5_BASE                   TIM5_BASE_S

#define TIM6                        TIM6_S
#define TIM6_BASE                   TIM6_BASE_S

#define TIM7                        TIM7_S
#define TIM7_BASE                   TIM7_BASE_S

#define TIM12                       TIM12_S
#define TIM12_BASE                  TIM12_BASE_S

#define TIM13                       TIM13_S
#define TIM13_BASE                  TIM13_BASE_S

#define TIM14                       TIM14_S
#define TIM14_BASE                  TIM14_BASE_S

#define LPTIM1                      LPTIM1_S
#define LPTIM1_BASE                 LPTIM1_BASE_S

#define LPTIM2                      LPTIM2_S
#define LPTIM2_BASE                 LPTIM2_BASE_S

#define SPI2                        SPI2_S
#define SPI2_BASE                   SPI2_BASE_S

#define SPI3                        SPI3_S
#define SPI3_BASE                   SPI3_BASE_S

#define SPDIFRX                     SPDIFRX_S
#define SPDIFRX_BASE                SPDIFRX_BASE_S

#define USART2                      USART2_S
#define USART2_BASE                 USART2_BASE_S

#define USART3                      USART3_S
#define USART3_BASE                 USART3_BASE_S

#define UART4                       UART4_S
#define UART4_BASE                  UART4_BASE_S

#define UART5                       UART5_S
#define UART5_BASE                  UART5_BASE_S

#define I2C1                        I2C1_S
#define I2C1_BASE                   I2C1_BASE_S

#define I2C2                        I2C2_S
#define I2C2_BASE                   I2C2_BASE_S

#define I2C3                        I2C3_S
#define I2C3_BASE                   I2C3_BASE_S

#define I2C4                        I2C4_S
#define I2C4_BASE                   I2C4_BASE_S

#define I2C5                        I2C5_S
#define I2C5_BASE                   I2C5_BASE_S

#define I2C6                        I2C6_S
#define I2C6_BASE                   I2C6_BASE_S

#define I2C7                        I2C7_S
#define I2C7_BASE                   I2C7_BASE_S

#define I3C1                        I3C1_S
#define I3C1_BASE                   I3C1_BASE_S

#define I3C2                        I3C2_S
#define I3C2_BASE                   I3C2_BASE_S

#define I3C3                        I3C3_S
#define I3C3_BASE                   I3C3_BASE_S

#define TIM10                       TIM10_S
#define TIM10_BASE                  TIM10_BASE_S

#define TIM11                       TIM11_S
#define TIM11_BASE                  TIM11_BASE_S

/*!< APB2 peripherals defaults to Secure aliases */
#define TIM1                        TIM1_S
#define TIM1_BASE                   TIM1_BASE_S

#define TIM8                        TIM8_S
#define TIM8_BASE                   TIM8_BASE_S

#define USART6                      USART6_S
#define USART6_BASE                 USART6_BASE_S

#define SPI1                        SPI1_S
#define SPI1_BASE                   SPI1_BASE_S

#define SPI4                        SPI4_S
#define SPI4_BASE                   SPI4_BASE_S

#define TIM15                       TIM15_S
#define TIM15_BASE                  TIM15_BASE_S

#define TIM16                       TIM16_S
#define TIM16_BASE                  TIM16_BASE_S

#define TIM17                       TIM17_S
#define TIM17_BASE                  TIM17_BASE_S

#define SPI5                        SPI5_S
#define SPI5_BASE                   SPI5_BASE_S

#define SAI1                        SAI1_S
#define SAI1_BASE                   SAI1_BASE_S

