STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251axx_cm33.h
/**************  Bit definition for ETH_MACA3HR register  **************/
#define ETH_MACA3HR_ADDRHI_Pos              (0U)
#define ETH_MACA3HR_ADDRHI_Msk              (0xFFFFUL << ETH_MACA3HR_ADDRHI_Pos)                 /*!< 0x0000FFFF */
#define ETH_MACA3HR_ADDRHI                  ETH_MACA3HR_ADDRHI_Msk                              /*!< MAC Address1 [47:32] */
#define ETH_MACA3HR_ADDRHI_0                (0x1UL << ETH_MACA3HR_ADDRHI_Pos)                    /*!< 0x00000001 */
#define ETH_MACA3HR_ADDRHI_1                (0x2UL << ETH_MACA3HR_ADDRHI_Pos)                    /*!< 0x00000002 */
#define ETH_MACA3HR_ADDRHI_2                (0x4UL << ETH_MACA3HR_ADDRHI_Pos)                    /*!< 0x00000004 */
#define ETH_MACA3HR_ADDRHI_3                (0x8UL << ETH_MACA3HR_ADDRHI_Pos)                    /*!< 0x00000008 */
#define ETH_MACA3HR_ADDRHI_4                (0x10UL << ETH_MACA3HR_ADDRHI_Pos)                   /*!< 0x00000010 */
#define ETH_MACA3HR_ADDRHI_5                (0x20UL << ETH_MACA3HR_ADDRHI_Pos)                   /*!< 0x00000020 */
#define ETH_MACA3HR_ADDRHI_6                (0x40UL << ETH_MACA3HR_ADDRHI_Pos)                   /*!< 0x00000040 */
#define ETH_MACA3HR_ADDRHI_7                (0x80UL << ETH_MACA3HR_ADDRHI_Pos)                   /*!< 0x00000080 */
#define ETH_MACA3HR_ADDRHI_8                (0x100UL << ETH_MACA3HR_ADDRHI_Pos)                  /*!< 0x00000100 */
#define ETH_MACA3HR_ADDRHI_9                (0x200UL << ETH_MACA3HR_ADDRHI_Pos)                  /*!< 0x00000200 */
#define ETH_MACA3HR_ADDRHI_10               (0x400UL << ETH_MACA3HR_ADDRHI_Pos)                  /*!< 0x00000400 */
#define ETH_MACA3HR_ADDRHI_11               (0x800UL << ETH_MACA3HR_ADDRHI_Pos)                  /*!< 0x00000800 */
#define ETH_MACA3HR_ADDRHI_12               (0x1000UL << ETH_MACA3HR_ADDRHI_Pos)                 /*!< 0x00001000 */
#define ETH_MACA3HR_ADDRHI_13               (0x2000UL << ETH_MACA3HR_ADDRHI_Pos)                 /*!< 0x00002000 */
#define ETH_MACA3HR_ADDRHI_14               (0x4000UL << ETH_MACA3HR_ADDRHI_Pos)                 /*!< 0x00004000 */
#define ETH_MACA3HR_ADDRHI_15               (0x8000UL << ETH_MACA3HR_ADDRHI_Pos)                 /*!< 0x00008000 */
#define ETH_MACA3HR_DCS_Pos                 (16U)
#define ETH_MACA3HR_DCS_Msk                 (0x1UL << ETH_MACA3HR_DCS_Pos)                        /*!< 0x00010000 */
#define ETH_MACA3HR_DCS                     ETH_MACA3HR_DCS_Msk                                 /*!< DMA Channel Select */
#define ETH_MACA3HR_MBC_Pos                 (24U)
#define ETH_MACA3HR_MBC_Msk                 (0x3FUL << ETH_MACA3HR_MBC_Pos)                      /*!< 0x3F000000 */
#define ETH_MACA3HR_MBC                     ETH_MACA3HR_MBC_Msk                                 /*!< Mask Byte Control */
#define ETH_MACA3HR_MBC_0                   (0x1UL << ETH_MACA3HR_MBC_Pos)                       /*!< 0x01000000 */
#define ETH_MACA3HR_MBC_1                   (0x2UL << ETH_MACA3HR_MBC_Pos)                       /*!< 0x02000000 */
#define ETH_MACA3HR_MBC_2                   (0x4UL << ETH_MACA3HR_MBC_Pos)                       /*!< 0x04000000 */
#define ETH_MACA3HR_MBC_3                   (0x8UL << ETH_MACA3HR_MBC_Pos)                       /*!< 0x08000000 */
#define ETH_MACA3HR_MBC_4                   (0x10UL << ETH_MACA3HR_MBC_Pos)                      /*!< 0x10000000 */
#define ETH_MACA3HR_MBC_5                   (0x20UL << ETH_MACA3HR_MBC_Pos)                      /*!< 0x20000000 */
#define ETH_MACA3HR_SA_Pos                  (30U)
#define ETH_MACA3HR_SA_Msk                  (0x1UL << ETH_MACA3HR_SA_Pos)                        /*!< 0x40000000 */
#define ETH_MACA3HR_SA                      ETH_MACA3HR_SA_Msk                                  /*!< Source Address */
#define ETH_MACA3HR_AE_Pos                  (31U)
#define ETH_MACA3HR_AE_Msk                  (0x1UL << ETH_MACA3HR_AE_Pos)                        /*!< 0x80000000 */
#define ETH_MACA3HR_AE                      ETH_MACA3HR_AE_Msk                                  /*!< Address Enable */

/**************  Bit definition for ETH_MACA3LR register  **************/
#define ETH_MACA3LR_ADDRLO_Pos              (0U)
#define ETH_MACA3LR_ADDRLO_Msk              (0xFFFFFFFFUL << ETH_MACA3LR_ADDRLO_Pos)             /*!< 0xFFFFFFFF */
#define ETH_MACA3LR_ADDRLO                  ETH_MACA3LR_ADDRLO_Msk                              /*!< MAC Address x [31:0] (x = 0 to 3) */
#define ETH_MACA3LR_ADDRLO_0                (0x1UL << ETH_MACA3LR_ADDRLO_Pos)                    /*!< 0x00000001 */
#define ETH_MACA3LR_ADDRLO_1                (0x2UL << ETH_MACA3LR_ADDRLO_Pos)                    /*!< 0x00000002 */
#define ETH_MACA3LR_ADDRLO_2                (0x4UL << ETH_MACA3LR_ADDRLO_Pos)                    /*!< 0x00000004 */
#define ETH_MACA3LR_ADDRLO_3                (0x8UL << ETH_MACA3LR_ADDRLO_Pos)                    /*!< 0x00000008 */
#define ETH_MACA3LR_ADDRLO_4                (0x10UL << ETH_MACA3LR_ADDRLO_Pos)                   /*!< 0x00000010 */
#define ETH_MACA3LR_ADDRLO_5                (0x20UL << ETH_MACA3LR_ADDRLO_Pos)                   /*!< 0x00000020 */
#define ETH_MACA3LR_ADDRLO_6                (0x40UL << ETH_MACA3LR_ADDRLO_Pos)                   /*!< 0x00000040 */
#define ETH_MACA3LR_ADDRLO_7                (0x80UL << ETH_MACA3LR_ADDRLO_Pos)                   /*!< 0x00000080 */
#define ETH_MACA3LR_ADDRLO_8                (0x100UL << ETH_MACA3LR_ADDRLO_Pos)                  /*!< 0x00000100 */
#define ETH_MACA3LR_ADDRLO_9                (0x200UL << ETH_MACA3LR_ADDRLO_Pos)                  /*!< 0x00000200 */
#define ETH_MACA3LR_ADDRLO_10               (0x400UL << ETH_MACA3LR_ADDRLO_Pos)                  /*!< 0x00000400 */
#define ETH_MACA3LR_ADDRLO_11               (0x800UL << ETH_MACA3LR_ADDRLO_Pos)                  /*!< 0x00000800 */
#define ETH_MACA3LR_ADDRLO_12               (0x1000UL << ETH_MACA3LR_ADDRLO_Pos)                 /*!< 0x00001000 */
#define ETH_MACA3LR_ADDRLO_13               (0x2000UL << ETH_MACA3LR_ADDRLO_Pos)                 /*!< 0x00002000 */
#define ETH_MACA3LR_ADDRLO_14               (0x4000UL << ETH_MACA3LR_ADDRLO_Pos)                 /*!< 0x00004000 */
#define ETH_MACA3LR_ADDRLO_15               (0x8000UL << ETH_MACA3LR_ADDRLO_Pos)                 /*!< 0x00008000 */
#define ETH_MACA3LR_ADDRLO_16               (0x10000UL << ETH_MACA3LR_ADDRLO_Pos)                /*!< 0x00010000 */
#define ETH_MACA3LR_ADDRLO_17               (0x20000UL << ETH_MACA3LR_ADDRLO_Pos)                /*!< 0x00020000 */
#define ETH_MACA3LR_ADDRLO_18               (0x40000UL << ETH_MACA3LR_ADDRLO_Pos)                /*!< 0x00040000 */
#define ETH_MACA3LR_ADDRLO_19               (0x80000UL << ETH_MACA3LR_ADDRLO_Pos)                /*!< 0x00080000 */
#define ETH_MACA3LR_ADDRLO_20               (0x100000UL << ETH_MACA3LR_ADDRLO_Pos)               /*!< 0x00100000 */
#define ETH_MACA3LR_ADDRLO_21               (0x200000UL << ETH_MACA3LR_ADDRLO_Pos)               /*!< 0x00200000 */
#define ETH_MACA3LR_ADDRLO_22               (0x400000UL << ETH_MACA3LR_ADDRLO_Pos)               /*!< 0x00400000 */
#define ETH_MACA3LR_ADDRLO_23               (0x800000UL << ETH_MACA3LR_ADDRLO_Pos)               /*!< 0x00800000 */
#define ETH_MACA3LR_ADDRLO_24               (0x1000000UL << ETH_MACA3LR_ADDRLO_Pos)              /*!< 0x01000000 */
#define ETH_MACA3LR_ADDRLO_25               (0x2000000UL << ETH_MACA3LR_ADDRLO_Pos)              /*!< 0x02000000 */
#define ETH_MACA3LR_ADDRLO_26               (0x4000000UL << ETH_MACA3LR_ADDRLO_Pos)              /*!< 0x04000000 */
#define ETH_MACA3LR_ADDRLO_27               (0x8000000UL << ETH_MACA3LR_ADDRLO_Pos)              /*!< 0x08000000 */
#define ETH_MACA3LR_ADDRLO_28               (0x10000000UL << ETH_MACA3LR_ADDRLO_Pos)             /*!< 0x10000000 */
#define ETH_MACA3LR_ADDRLO_29               (0x20000000UL << ETH_MACA3LR_ADDRLO_Pos)             /*!< 0x20000000 */
#define ETH_MACA3LR_ADDRLO_30               (0x40000000UL << ETH_MACA3LR_ADDRLO_Pos)             /*!< 0x40000000 */
#define ETH_MACA3LR_ADDRLO_31               (0x80000000UL << ETH_MACA3LR_ADDRLO_Pos)             /*!< 0x80000000 */

/***************  Bit definition for ETH_MMC_CONTROL register  ****************/
#define ETH_MMC_CONTROL_CNTRST_Pos          (0U)
#define ETH_MMC_CONTROL_CNTRST_Msk          (0x1UL << ETH_MMC_CONTROL_CNTRST_Pos)                 /*!< 0x00000001 */
#define ETH_MMC_CONTROL_CNTRST              ETH_MMC_CONTROL_CNTRST_Msk                           /*!< Counters Reset */
#define ETH_MMC_CONTROL_CNTSTOPRO_Pos       (1U)
#define ETH_MMC_CONTROL_CNTSTOPRO_Msk       (0x1UL << ETH_MMC_CONTROL_CNTSTOPRO_Pos)              /*!< 0x00000002 */
#define ETH_MMC_CONTROL_CNTSTOPRO           ETH_MMC_CONTROL_CNTSTOPRO_Msk                        /*!< Counter Stop Rollover */
#define ETH_MMC_CONTROL_RSTONRD_Pos         (2U)
#define ETH_MMC_CONTROL_RSTONRD_Msk         (0x1UL << ETH_MMC_CONTROL_RSTONRD_Pos)                /*!< 0x00000004 */
#define ETH_MMC_CONTROL_RSTONRD             ETH_MMC_CONTROL_RSTONRD_Msk                          /*!< Reset on Read */
#define ETH_MMC_CONTROL_CNTFREEZ_Pos        (3U)
#define ETH_MMC_CONTROL_CNTFREEZ_Msk        (0x1UL << ETH_MMC_CONTROL_CNTFREEZ_Pos)               /*!< 0x00000008 */
#define ETH_MMC_CONTROL_CNTFREEZ            ETH_MMC_CONTROL_CNTFREEZ_Msk                         /*!< MMC Counter Freeze */
#define ETH_MMC_CONTROL_CNTPRST_Pos         (4U)
#define ETH_MMC_CONTROL_CNTPRST_Msk         (0x1UL << ETH_MMC_CONTROL_CNTPRST_Pos)                /*!< 0x00000010 */
#define ETH_MMC_CONTROL_CNTPRST             ETH_MMC_CONTROL_CNTPRST_Msk                          /*!< Counters Preset */
#define ETH_MMC_CONTROL_CNTPRSTLVL_Pos      (5U)
#define ETH_MMC_CONTROL_CNTPRSTLVL_Msk      (0x1UL << ETH_MMC_CONTROL_CNTPRSTLVL_Pos)             /*!< 0x00000020 */
#define ETH_MMC_CONTROL_CNTPRSTLVL          ETH_MMC_CONTROL_CNTPRSTLVL_Msk                       /*!< Full-Half Preset */
#define ETH_MMC_CONTROL_UCDBC_Pos           (8U)
#define ETH_MMC_CONTROL_UCDBC_Msk           (0x1UL << ETH_MMC_CONTROL_UCDBC_Pos)                  /*!< 0x00000100 */
#define ETH_MMC_CONTROL_UCDBC               ETH_MMC_CONTROL_UCDBC_Msk                            /*!< Update MMC Counters for Dropped Broadcast Packets */

/*************  Bit definition for ETH_MMC_RX_INTERRUPT register  *************/
#define ETH_MMC_RX_INTERRUPT_RXGBPKTIS_Pos            (0U)
#define ETH_MMC_RX_INTERRUPT_RXGBPKTIS_Msk            (0x1UL << ETH_MMC_RX_INTERRUPT_RXGBPKTIS_Pos)             /*!< 0x00000001 */
#define ETH_MMC_RX_INTERRUPT_RXGBPKTIS                ETH_MMC_RX_INTERRUPT_RXGBPKTIS_Msk                       /*!< MMC Receive Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXGBOCTIS_Pos            (1U)
#define ETH_MMC_RX_INTERRUPT_RXGBOCTIS_Msk            (0x1UL << ETH_MMC_RX_INTERRUPT_RXGBOCTIS_Pos)             /*!< 0x00000002 */
#define ETH_MMC_RX_INTERRUPT_RXGBOCTIS                ETH_MMC_RX_INTERRUPT_RXGBOCTIS_Msk                       /*!< MMC Receive Good Bad Octet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXGOCTIS_Pos             (2U)
#define ETH_MMC_RX_INTERRUPT_RXGOCTIS_Msk             (0x1UL << ETH_MMC_RX_INTERRUPT_RXGOCTIS_Pos)              /*!< 0x00000004 */
#define ETH_MMC_RX_INTERRUPT_RXGOCTIS                 ETH_MMC_RX_INTERRUPT_RXGOCTIS_Msk                        /*!< MMC Receive Good Octet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXBCGPIS_Pos             (3U)
#define ETH_MMC_RX_INTERRUPT_RXBCGPIS_Msk             (0x1UL << ETH_MMC_RX_INTERRUPT_RXBCGPIS_Pos)              /*!< 0x00000008 */
#define ETH_MMC_RX_INTERRUPT_RXBCGPIS                 ETH_MMC_RX_INTERRUPT_RXBCGPIS_Msk                        /*!< MMC Receive Broadcast Good Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXMCGPIS_Pos             (4U)
#define ETH_MMC_RX_INTERRUPT_RXMCGPIS_Msk             (0x1UL << ETH_MMC_RX_INTERRUPT_RXMCGPIS_Pos)              /*!< 0x00000010 */
#define ETH_MMC_RX_INTERRUPT_RXMCGPIS                 ETH_MMC_RX_INTERRUPT_RXMCGPIS_Msk                        /*!< MMC Receive Multicast Good Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Pos           (5U)
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Msk           (0x1UL << ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Pos)            /*!< 0x00000020 */
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS               ETH_MMC_RX_INTERRUPT_RXCRCERPIS_Msk                      /*!< MMC Receive CRC Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Pos          (6U)
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Msk          (0x1UL << ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Pos)           /*!< 0x00000040 */
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS              ETH_MMC_RX_INTERRUPT_RXALGNERPIS_Msk                     /*!< MMC Receive Alignment Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXRUNTPIS_Pos            (7U)
#define ETH_MMC_RX_INTERRUPT_RXRUNTPIS_Msk            (0x1UL << ETH_MMC_RX_INTERRUPT_RXRUNTPIS_Pos)             /*!< 0x00000080 */
#define ETH_MMC_RX_INTERRUPT_RXRUNTPIS                ETH_MMC_RX_INTERRUPT_RXRUNTPIS_Msk                       /*!< MMC Receive Runt Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXJABERPIS_Pos           (8U)
#define ETH_MMC_RX_INTERRUPT_RXJABERPIS_Msk           (0x1UL << ETH_MMC_RX_INTERRUPT_RXJABERPIS_Pos)            /*!< 0x00000100 */
#define ETH_MMC_RX_INTERRUPT_RXJABERPIS               ETH_MMC_RX_INTERRUPT_RXJABERPIS_Msk                      /*!< MMC Receive Jabber Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_Pos          (9U)
#define ETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_Msk          (0x1UL << ETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_Pos)           /*!< 0x00000200 */
#define ETH_MMC_RX_INTERRUPT_RXUSIZEGPIS              ETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_Msk                     /*!< MMC Receive Undersize Good Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_Pos          (10U)
#define ETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_Msk          (0x1UL << ETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_Pos)           /*!< 0x00000400 */
#define ETH_MMC_RX_INTERRUPT_RXOSIZEGPIS              ETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_Msk                     /*!< MMC Receive Oversize Good Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_Pos         (11U)
#define ETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_Msk         (0x1UL << ETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_Pos)          /*!< 0x00000800 */
#define ETH_MMC_RX_INTERRUPT_RX64OCTGBPIS             ETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_Msk                    /*!< MMC Receive 64 Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_Pos     (12U)
#define ETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_Msk     (0x1UL << ETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_Pos)      /*!< 0x00001000 */
#define ETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS         ETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_Msk                /*!< MMC Receive 65 to 127 Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_Pos    (13U)
#define ETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_Msk    (0x1UL << ETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_Pos)     /*!< 0x00002000 */
#define ETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS        ETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_Msk               /*!< MMC Receive 128 to 255 Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_Pos    (14U)
#define ETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_Msk    (0x1UL << ETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_Pos)     /*!< 0x00004000 */
#define ETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS        ETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_Msk               /*!< MMC Receive 256 to 511 Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_Pos   (15U)
#define ETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_Msk   (0x1UL << ETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_Pos)    /*!< 0x00008000 */
#define ETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS       ETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_Msk              /*!< MMC Receive 512 to 1023 Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_Pos   (16U)
#define ETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_Msk   (0x1UL << ETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_Pos)    /*!< 0x00010000 */
#define ETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS       ETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_Msk              /*!< MMC Receive 1024 to Maximum Octet Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS_Pos             (17U)
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS_Msk             (0x1UL << ETH_MMC_RX_INTERRUPT_RXUCGPIS_Pos)              /*!< 0x00020000 */
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS                 ETH_MMC_RX_INTERRUPT_RXUCGPIS_Msk                        /*!< MMC Receive Unicast Good Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXLENERPIS_Pos           (18U)
#define ETH_MMC_RX_INTERRUPT_RXLENERPIS_Msk           (0x1UL << ETH_MMC_RX_INTERRUPT_RXLENERPIS_Pos)            /*!< 0x00040000 */
#define ETH_MMC_RX_INTERRUPT_RXLENERPIS               ETH_MMC_RX_INTERRUPT_RXLENERPIS_Msk                      /*!< MMC Receive Length Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXORANGEPIS_Pos          (19U)
#define ETH_MMC_RX_INTERRUPT_RXORANGEPIS_Msk          (0x1UL << ETH_MMC_RX_INTERRUPT_RXORANGEPIS_Pos)           /*!< 0x00080000 */
#define ETH_MMC_RX_INTERRUPT_RXORANGEPIS              ETH_MMC_RX_INTERRUPT_RXORANGEPIS_Msk                     /*!< MMC Receive Out Of Range Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXPAUSPIS_Pos            (20U)
#define ETH_MMC_RX_INTERRUPT_RXPAUSPIS_Msk            (0x1UL << ETH_MMC_RX_INTERRUPT_RXPAUSPIS_Pos)             /*!< 0x00100000 */
#define ETH_MMC_RX_INTERRUPT_RXPAUSPIS                ETH_MMC_RX_INTERRUPT_RXPAUSPIS_Msk                       /*!< MMC Receive Pause Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXFOVPIS_Pos             (21U)
#define ETH_MMC_RX_INTERRUPT_RXFOVPIS_Msk             (0x1UL << ETH_MMC_RX_INTERRUPT_RXFOVPIS_Pos)              /*!< 0x00200000 */
#define ETH_MMC_RX_INTERRUPT_RXFOVPIS                 ETH_MMC_RX_INTERRUPT_RXFOVPIS_Msk                        /*!< MMC Receive FIFO Overflow Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXVLANGBPIS_Pos          (22U)
#define ETH_MMC_RX_INTERRUPT_RXVLANGBPIS_Msk          (0x1UL << ETH_MMC_RX_INTERRUPT_RXVLANGBPIS_Pos)           /*!< 0x00400000 */
#define ETH_MMC_RX_INTERRUPT_RXVLANGBPIS              ETH_MMC_RX_INTERRUPT_RXVLANGBPIS_Msk                     /*!< MMC Receive VLAN Good Bad Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXWDOGPIS_Pos            (23U)
#define ETH_MMC_RX_INTERRUPT_RXWDOGPIS_Msk            (0x1UL << ETH_MMC_RX_INTERRUPT_RXWDOGPIS_Pos)             /*!< 0x00800000 */
#define ETH_MMC_RX_INTERRUPT_RXWDOGPIS                ETH_MMC_RX_INTERRUPT_RXWDOGPIS_Msk                       /*!< MMC Receive Watchdog Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXRCVERRPIS_Pos          (24U)
#define ETH_MMC_RX_INTERRUPT_RXRCVERRPIS_Msk          (0x1UL << ETH_MMC_RX_INTERRUPT_RXRCVERRPIS_Pos)           /*!< 0x01000000 */
#define ETH_MMC_RX_INTERRUPT_RXRCVERRPIS              ETH_MMC_RX_INTERRUPT_RXRCVERRPIS_Msk                     /*!< MMC Receive Error Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXCTRLPIS_Pos            (25U)
#define ETH_MMC_RX_INTERRUPT_RXCTRLPIS_Msk            (0x1UL << ETH_MMC_RX_INTERRUPT_RXCTRLPIS_Pos)             /*!< 0x02000000 */
#define ETH_MMC_RX_INTERRUPT_RXCTRLPIS                ETH_MMC_RX_INTERRUPT_RXCTRLPIS_Msk                       /*!< MMC Receive Control Packet Counter Interrupt Status */
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Pos           (26U)
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Msk           (0x1UL << ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Pos)            /*!< 0x04000000 */
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS               ETH_MMC_RX_INTERRUPT_RXLPIUSCIS_Msk                      /*!< MMC Receive LPI microsecond counter interrupt status */
#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Pos           (27U)
#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Msk           (0x1UL << ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Pos)            /*!< 0x08000000 */
#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS               ETH_MMC_RX_INTERRUPT_RXLPITRCIS_Msk                      /*!< MMC Receive LPI transition counter interrupt status */

