STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp251axx_cm33.h
/*****************  Bit definition for ETH_DMAC3IER register  *****************/
#define ETH_DMAC3IER_TIE_Pos                (0U)
#define ETH_DMAC3IER_TIE_Msk                (0x1UL << ETH_DMAC3IER_TIE_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC3IER_TIE                    ETH_DMAC3IER_TIE_Msk                                /*!< Transmit Interrupt Enable */
#define ETH_DMAC3IER_TXSE_Pos               (1U)
#define ETH_DMAC3IER_TXSE_Msk               (0x1UL << ETH_DMAC3IER_TXSE_Pos)                     /*!< 0x00000002 */
#define ETH_DMAC3IER_TXSE                   ETH_DMAC3IER_TXSE_Msk                               /*!< Transmit Stopped Enable */
#define ETH_DMAC3IER_TBUE_Pos               (2U)
#define ETH_DMAC3IER_TBUE_Msk               (0x1UL << ETH_DMAC3IER_TBUE_Pos)                     /*!< 0x00000004 */
#define ETH_DMAC3IER_TBUE                   ETH_DMAC3IER_TBUE_Msk                               /*!< Transmit Buffer Unavailable Enable */
#define ETH_DMAC3IER_RIE_Pos                (6U)
#define ETH_DMAC3IER_RIE_Msk                (0x1UL << ETH_DMAC3IER_RIE_Pos)                      /*!< 0x00000040 */
#define ETH_DMAC3IER_RIE                    ETH_DMAC3IER_RIE_Msk                                /*!< Receive Interrupt Enable */
#define ETH_DMAC3IER_RBUE_Pos               (7U)
#define ETH_DMAC3IER_RBUE_Msk               (0x1UL << ETH_DMAC3IER_RBUE_Pos)                     /*!< 0x00000080 */
#define ETH_DMAC3IER_RBUE                   ETH_DMAC3IER_RBUE_Msk                               /*!< Receive Buffer Unavailable Enable */
#define ETH_DMAC3IER_RSE_Pos                (8U)
#define ETH_DMAC3IER_RSE_Msk                (0x1UL << ETH_DMAC3IER_RSE_Pos)                      /*!< 0x00000100 */
#define ETH_DMAC3IER_RSE                    ETH_DMAC3IER_RSE_Msk                                /*!< Receive Stopped Enable */
#define ETH_DMAC3IER_RWTE_Pos               (9U)
#define ETH_DMAC3IER_RWTE_Msk               (0x1UL << ETH_DMAC3IER_RWTE_Pos)                     /*!< 0x00000200 */
#define ETH_DMAC3IER_RWTE                   ETH_DMAC3IER_RWTE_Msk                               /*!< Receive Watchdog Timeout Enable */
#define ETH_DMAC3IER_ETIE_Pos               (10U)
#define ETH_DMAC3IER_ETIE_Msk               (0x1UL << ETH_DMAC3IER_ETIE_Pos)                     /*!< 0x00000400 */
#define ETH_DMAC3IER_ETIE                   ETH_DMAC3IER_ETIE_Msk                               /*!< Early Transmit Interrupt Enable */
#define ETH_DMAC3IER_ERIE_Pos               (11U)
#define ETH_DMAC3IER_ERIE_Msk               (0x1UL << ETH_DMAC3IER_ERIE_Pos)                     /*!< 0x00000800 */
#define ETH_DMAC3IER_ERIE                   ETH_DMAC3IER_ERIE_Msk                               /*!< Early receive interrupt Enable */
#define ETH_DMAC3IER_FBEE_Pos               (12U)
#define ETH_DMAC3IER_FBEE_Msk               (0x1UL << ETH_DMAC3IER_FBEE_Pos)                     /*!< 0x00001000 */
#define ETH_DMAC3IER_FBEE                   ETH_DMAC3IER_FBEE_Msk                               /*!< Fatal Bus Error Enable */
#define ETH_DMAC3IER_CDEE_Pos               (13U)
#define ETH_DMAC3IER_CDEE_Msk               (0x1UL << ETH_DMAC3IER_CDEE_Pos)                     /*!< 0x00002000 */
#define ETH_DMAC3IER_CDEE                   ETH_DMAC3IER_CDEE_Msk                               /*!< Context Descriptor Error Enable */
#define ETH_DMAC3IER_AIE_Pos                (14U)
#define ETH_DMAC3IER_AIE_Msk                (0x1UL << ETH_DMAC3IER_AIE_Pos)                      /*!< 0x00004000 */
#define ETH_DMAC3IER_AIE                    ETH_DMAC3IER_AIE_Msk                                /*!< Abnormal Interrupt Summary Enable */
#define ETH_DMAC3IER_NIE_Pos                (15U)
#define ETH_DMAC3IER_NIE_Msk                (0x1UL << ETH_DMAC3IER_NIE_Pos)                      /*!< 0x00008000 */
#define ETH_DMAC3IER_NIE                    ETH_DMAC3IER_NIE_Msk                                /*!< Normal Interrupt Summary Enable */

/****************  Bit definition for ETH_DMAC3SFCSR register  ****************/
#define ETH_DMAC3SFCSR_ESC_Pos              (0U)
#define ETH_DMAC3SFCSR_ESC_Msk              (0x1UL << ETH_DMAC3SFCSR_ESC_Pos)                    /*!< 0x00000001 */
#define ETH_DMAC3SFCSR_ESC                  ETH_DMAC3SFCSR_ESC_Msk                              /*!< Enable Slot Comparison */
#define ETH_DMAC3SFCSR_ASC_Pos              (1U)
#define ETH_DMAC3SFCSR_ASC_Msk              (0x1UL << ETH_DMAC3SFCSR_ASC_Pos)                    /*!< 0x00000002 */
#define ETH_DMAC3SFCSR_ASC                  ETH_DMAC3SFCSR_ASC_Msk                              /*!< Advance Slot Check */
#define ETH_DMAC3SFCSR_SIV_Pos              (4U)
#define ETH_DMAC3SFCSR_SIV_Msk              (0xFFFUL << ETH_DMAC3SFCSR_SIV_Pos)                   /*!< 0x0000FFF0 */
#define ETH_DMAC3SFCSR_SIV                  ETH_DMAC3SFCSR_SIV_Msk                              /*!< Slot Interval Value */
#define ETH_DMAC3SFCSR_RSN_Pos              (16U)
#define ETH_DMAC3SFCSR_RSN_Msk              (0xFUL << ETH_DMAC3SFCSR_RSN_Pos)                     /*!< 0x000F0000 */
#define ETH_DMAC3SFCSR_RSN                  ETH_DMAC3SFCSR_RSN_Msk                              /*!< Reference Slot Number */

/***************  Bit definition for ETH_DMAC3CATXDR register  ****************/
#define ETH_DMAC3CATXDR_CURTDESAPTR_Pos     (0U)
#define ETH_DMAC3CATXDR_CURTDESAPTR_Msk     (0xFFFFFFFFUL << ETH_DMAC3CATXDR_CURTDESAPTR_Pos)    /*!< 0xFFFFFFFF */
#define ETH_DMAC3CATXDR_CURTDESAPTR         ETH_DMAC3CATXDR_CURTDESAPTR_Msk                     /*!< Application Transmit Descriptor Address Pointer */

/***************  Bit definition for ETH_DMAC3CATXBR register  ****************/
#define ETH_DMAC3CATXBR_CURTBUFAPTR_Pos     (0U)
#define ETH_DMAC3CATXBR_CURTBUFAPTR_Msk     (0xFFFFFFFFUL << ETH_DMAC3CATXBR_CURTBUFAPTR_Pos)    /*!< 0xFFFFFFFF */
#define ETH_DMAC3CATXBR_CURTBUFAPTR         ETH_DMAC3CATXBR_CURTBUFAPTR_Msk                     /*!< Application Transmit Buffer Address Pointer */

/*****************  Bit definition for ETH_DMAC3SR register  ******************/
#define ETH_DMAC3SR_TI_Pos                  (0U)
#define ETH_DMAC3SR_TI_Msk                  (0x1UL << ETH_DMAC3SR_TI_Pos)                        /*!< 0x00000001 */
#define ETH_DMAC3SR_TI                      ETH_DMAC3SR_TI_Msk                                  /*!< Transmit Interrupt */
#define ETH_DMAC3SR_TPS_Pos                 (1U)
#define ETH_DMAC3SR_TPS_Msk                 (0x1UL << ETH_DMAC3SR_TPS_Pos)                       /*!< 0x00000002 */
#define ETH_DMAC3SR_TPS                     ETH_DMAC3SR_TPS_Msk                                 /*!< Transmit Process Stopped */
#define ETH_DMAC3SR_TBU_Pos                 (2U)
#define ETH_DMAC3SR_TBU_Msk                 (0x1UL << ETH_DMAC3SR_TBU_Pos)                       /*!< 0x00000004 */
#define ETH_DMAC3SR_TBU                     ETH_DMAC3SR_TBU_Msk                                 /*!< Transmit Buffer Unavailable */
#define ETH_DMAC3SR_RI_Pos                  (6U)
#define ETH_DMAC3SR_RI_Msk                  (0x1UL << ETH_DMAC3SR_RI_Pos)                        /*!< 0x00000040 */
#define ETH_DMAC3SR_RI                      ETH_DMAC3SR_RI_Msk                                  /*!< Receive Interrupt */
#define ETH_DMAC3SR_RBU_Pos                 (7U)
#define ETH_DMAC3SR_RBU_Msk                 (0x1UL << ETH_DMAC3SR_RBU_Pos)                       /*!< 0x00000080 */
#define ETH_DMAC3SR_RBU                     ETH_DMAC3SR_RBU_Msk                                 /*!< Receive Buffer Unavailable */
#define ETH_DMAC3SR_RPS_Pos                 (8U)
#define ETH_DMAC3SR_RPS_Msk                 (0x1UL << ETH_DMAC3SR_RPS_Pos)                       /*!< 0x00000100 */
#define ETH_DMAC3SR_RPS                     ETH_DMAC3SR_RPS_Msk                                 /*!< Receive Process Stopped */
#define ETH_DMAC3SR_RWT_Pos                 (9U)
#define ETH_DMAC3SR_RWT_Msk                 (0x1UL << ETH_DMAC3SR_RWT_Pos)                       /*!< 0x00000200 */
#define ETH_DMAC3SR_RWT                     ETH_DMAC3SR_RWT_Msk                                 /*!< Receive Watchdog Timeout */
#define ETH_DMAC3SR_ETI_Pos                 (10U)
#define ETH_DMAC3SR_ETI_Msk                 (0x1UL << ETH_DMAC3SR_ETI_Pos)                       /*!< 0x00000400 */
#define ETH_DMAC3SR_ETI                     ETH_DMAC3SR_ETI_Msk                                 /*!< Early Transmit Interrupt */
#define ETH_DMAC3SR_ERI_Pos                 (11U)
#define ETH_DMAC3SR_ERI_Msk                 (0x1UL << ETH_DMAC3SR_ERI_Pos)                       /*!< 0x00000800 */
#define ETH_DMAC3SR_ERI                     ETH_DMAC3SR_ERI_Msk                                 /*!< Early Receive Interrupt */
#define ETH_DMAC3SR_FBE_Pos                 (12U)
#define ETH_DMAC3SR_FBE_Msk                 (0x1UL << ETH_DMAC3SR_FBE_Pos)                       /*!< 0x00001000 */
#define ETH_DMAC3SR_FBE                     ETH_DMAC3SR_FBE_Msk                                 /*!< Fatal Bus Error */
#define ETH_DMAC3SR_CDE_Pos                 (13U)
#define ETH_DMAC3SR_CDE_Msk                 (0x1UL << ETH_DMAC3SR_CDE_Pos)                       /*!< 0x00002000 */
#define ETH_DMAC3SR_CDE                     ETH_DMAC3SR_CDE_Msk                                 /*!< Context Descriptor Error */
#define ETH_DMAC3SR_AIS_Pos                 (14U)
#define ETH_DMAC3SR_AIS_Msk                 (0x1UL << ETH_DMAC3SR_AIS_Pos)                       /*!< 0x00004000 */
#define ETH_DMAC3SR_AIS                     ETH_DMAC3SR_AIS_Msk                                 /*!< Abnormal Interrupt Summary */
#define ETH_DMAC3SR_NIS_Pos                 (15U)
#define ETH_DMAC3SR_NIS_Msk                 (0x1UL << ETH_DMAC3SR_NIS_Pos)                       /*!< 0x00008000 */
#define ETH_DMAC3SR_NIS                     ETH_DMAC3SR_NIS_Msk                                 /*!< Normal Interrupt Summary */
#define ETH_DMAC3SR_TEB_Pos                 (16U)
#define ETH_DMAC3SR_TEB_Msk                 (0x7UL << ETH_DMAC3SR_TEB_Pos)                        /*!< 0x00070000 */
#define ETH_DMAC3SR_TEB                     ETH_DMAC3SR_TEB_Msk                                 /*!< Tx DMA Error Bits */
#define ETH_DMAC3SR_REB_Pos                 (19U)
#define ETH_DMAC3SR_REB_Msk                 (0x7UL << ETH_DMAC3SR_REB_Pos)                        /*!< 0x00380000 */
#define ETH_DMAC3SR_REB                     ETH_DMAC3SR_REB_Msk                                 /*!< Rx DMA Error Bits */

/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                               EXTI1/EXTI2                                  */
/*                   c7amba_exti_v3-0_UserSpec_v3_0_0m.pdf                    */
/*                   register declared following documentation order          */
/******************************************************************************/

/******************  Bit definition for EXTI1_RTSR1 register  *******************/
#define EXTI1_RTSR1_RT0_Pos         (0U)
#define EXTI1_RTSR1_RT0_Msk         (0x1UL << EXTI1_RTSR1_RT0_Pos)                /*!< 0x00000001 */
#define EXTI1_RTSR1_RT0             EXTI1_RTSR1_RT0_Msk                          /*!< Rising trigger event configuration bit of line 0 */
#define EXTI1_RTSR1_RT1_Pos         (1U)
#define EXTI1_RTSR1_RT1_Msk         (0x1UL << EXTI1_RTSR1_RT1_Pos)                /*!< 0x00000002 */
#define EXTI1_RTSR1_RT1             EXTI1_RTSR1_RT1_Msk                          /*!< Rising trigger event configuration bit of line 1 */
#define EXTI1_RTSR1_RT2_Pos         (2U)
#define EXTI1_RTSR1_RT2_Msk         (0x1UL << EXTI1_RTSR1_RT2_Pos)                /*!< 0x00000004 */
#define EXTI1_RTSR1_RT2             EXTI1_RTSR1_RT2_Msk                          /*!< Rising trigger event configuration bit of line 2 */
#define EXTI1_RTSR1_RT3_Pos         (3U)
#define EXTI1_RTSR1_RT3_Msk         (0x1UL << EXTI1_RTSR1_RT3_Pos)                /*!< 0x00000008 */
#define EXTI1_RTSR1_RT3             EXTI1_RTSR1_RT3_Msk                          /*!< Rising trigger event configuration bit of line 3 */
#define EXTI1_RTSR1_RT4_Pos         (4U)
#define EXTI1_RTSR1_RT4_Msk         (0x1UL << EXTI1_RTSR1_RT4_Pos)                /*!< 0x00000010 */
#define EXTI1_RTSR1_RT4             EXTI1_RTSR1_RT4_Msk                          /*!< Rising trigger event configuration bit of line 4 */
#define EXTI1_RTSR1_RT5_Pos         (5U)
#define EXTI1_RTSR1_RT5_Msk         (0x1UL << EXTI1_RTSR1_RT5_Pos)                /*!< 0x00000020 */
#define EXTI1_RTSR1_RT5             EXTI1_RTSR1_RT5_Msk                          /*!< Rising trigger event configuration bit of line 5 */
#define EXTI1_RTSR1_RT6_Pos         (6U)
#define EXTI1_RTSR1_RT6_Msk         (0x1UL << EXTI1_RTSR1_RT6_Pos)                /*!< 0x00000040 */
#define EXTI1_RTSR1_RT6             EXTI1_RTSR1_RT6_Msk                          /*!< Rising trigger event configuration bit of line 6 */
#define EXTI1_RTSR1_RT7_Pos         (7U)
#define EXTI1_RTSR1_RT7_Msk         (0x1UL << EXTI1_RTSR1_RT7_Pos)                /*!< 0x00000080 */
#define EXTI1_RTSR1_RT7             EXTI1_RTSR1_RT7_Msk                          /*!< Rising trigger event configuration bit of line 7 */
#define EXTI1_RTSR1_RT8_Pos         (8U)
#define EXTI1_RTSR1_RT8_Msk         (0x1UL << EXTI1_RTSR1_RT8_Pos)                /*!< 0x00000100 */
#define EXTI1_RTSR1_RT8             EXTI1_RTSR1_RT8_Msk                          /*!< Rising trigger event configuration bit of line 8 */
#define EXTI1_RTSR1_RT9_Pos         (9U)
#define EXTI1_RTSR1_RT9_Msk         (0x1UL << EXTI1_RTSR1_RT9_Pos)                /*!< 0x00000200 */
#define EXTI1_RTSR1_RT9             EXTI1_RTSR1_RT9_Msk                          /*!< Rising trigger event configuration bit of line 9 */
#define EXTI1_RTSR1_RT10_Pos        (10U)
#define EXTI1_RTSR1_RT10_Msk        (0x1UL << EXTI1_RTSR1_RT10_Pos)               /*!< 0x00000400 */
#define EXTI1_RTSR1_RT10            EXTI1_RTSR1_RT10_Msk                         /*!< Rising trigger event configuration bit of line 10 */
#define EXTI1_RTSR1_RT11_Pos        (11U)
#define EXTI1_RTSR1_RT11_Msk        (0x1UL << EXTI1_RTSR1_RT11_Pos)               /*!< 0x00000800 */
#define EXTI1_RTSR1_RT11            EXTI1_RTSR1_RT11_Msk                         /*!< Rising trigger event configuration bit of line 11 */
#define EXTI1_RTSR1_RT12_Pos        (12U)
#define EXTI1_RTSR1_RT12_Msk        (0x1UL << EXTI1_RTSR1_RT12_Pos)               /*!< 0x00001000 */
#define EXTI1_RTSR1_RT12            EXTI1_RTSR1_RT12_Msk                         /*!< Rising trigger event configuration bit of line 12 */
#define EXTI1_RTSR1_RT13_Pos        (13U)
#define EXTI1_RTSR1_RT13_Msk        (0x1UL << EXTI1_RTSR1_RT13_Pos)               /*!< 0x00002000 */
#define EXTI1_RTSR1_RT13            EXTI1_RTSR1_RT13_Msk                         /*!< Rising trigger event configuration bit of line 13 */
#define EXTI1_RTSR1_RT14_Pos        (14U)
#define EXTI1_RTSR1_RT14_Msk        (0x1UL << EXTI1_RTSR1_RT14_Pos)               /*!< 0x00004000 */
#define EXTI1_RTSR1_RT14            EXTI1_RTSR1_RT14_Msk                         /*!< Rising trigger event configuration bit of line 14 */
#define EXTI1_RTSR1_RT15_Pos        (15U)
#define EXTI1_RTSR1_RT15_Msk        (0x1UL << EXTI1_RTSR1_RT15_Pos)               /*!< 0x00008000 */
#define EXTI1_RTSR1_RT15            EXTI1_RTSR1_RT15_Msk                         /*!< Rising trigger event configuration bit of line 15 */
#define EXTI1_RTSR1_RT16_Pos        (16U)
#define EXTI1_RTSR1_RT16_Msk        (0x1UL << EXTI1_RTSR1_RT16_Pos)               /*!< 0x00010000 */
#define EXTI1_RTSR1_RT16            EXTI1_RTSR1_RT16_Msk                         /*!< Rising trigger event configuration bit of line 16 */
#define EXTI1_RTSR1_RT17_Pos        (17U)
#define EXTI1_RTSR1_RT17_Msk        (0x1UL << EXTI1_RTSR1_RT17_Pos)               /*!< 0x00020000 */
#define EXTI1_RTSR1_RT17            EXTI1_RTSR1_RT17_Msk                         /*!< Rising trigger event configuration bit of line 17 */
#define EXTI1_RTSR1_RT18_Pos        (18U)
#define EXTI1_RTSR1_RT18_Msk        (0x1UL << EXTI1_RTSR1_RT18_Pos)               /*!< 0x00040000 */
#define EXTI1_RTSR1_RT18            EXTI1_RTSR1_RT18_Msk                         /*!< Rising trigger event configuration bit of line 18 */

/******************  Bit definition for EXTI1_FTSR1 register  *******************/
#define EXTI1_FTSR1_FT0_Pos         (0U)
#define EXTI1_FTSR1_FT0_Msk         (0x1UL << EXTI1_FTSR1_FT0_Pos)                /*!< 0x00000001 */
#define EXTI1_FTSR1_FT0             EXTI1_FTSR1_FT0_Msk                          /*!< Falling trigger event configuration bit of line 0 */
#define EXTI1_FTSR1_FT1_Pos         (1U)
#define EXTI1_FTSR1_FT1_Msk         (0x1UL << EXTI1_FTSR1_FT1_Pos)                /*!< 0x00000002 */
#define EXTI1_FTSR1_FT1             EXTI1_FTSR1_FT1_Msk                          /*!< Falling trigger event configuration bit of line 1 */
#define EXTI1_FTSR1_FT2_Pos         (2U)
#define EXTI1_FTSR1_FT2_Msk         (0x1UL << EXTI1_FTSR1_FT2_Pos)                /*!< 0x00000004 */
#define EXTI1_FTSR1_FT2             EXTI1_FTSR1_FT2_Msk                          /*!< Falling trigger event configuration bit of line 2 */
#define EXTI1_FTSR1_FT3_Pos         (3U)
#define EXTI1_FTSR1_FT3_Msk         (0x1UL << EXTI1_FTSR1_FT3_Pos)                /*!< 0x00000008 */
#define EXTI1_FTSR1_FT3             EXTI1_FTSR1_FT3_Msk                          /*!< Falling trigger event configuration bit of line 3 */
#define EXTI1_FTSR1_FT4_Pos         (4U)
#define EXTI1_FTSR1_FT4_Msk         (0x1UL << EXTI1_FTSR1_FT4_Pos)                /*!< 0x00000010 */
#define EXTI1_FTSR1_FT4             EXTI1_FTSR1_FT4_Msk                          /*!< Falling trigger event configuration bit of line 4 */
#define EXTI1_FTSR1_FT5_Pos         (5U)
#define EXTI1_FTSR1_FT5_Msk         (0x1UL << EXTI1_FTSR1_FT5_Pos)                /*!< 0x00000020 */
#define EXTI1_FTSR1_FT5             EXTI1_FTSR1_FT5_Msk                          /*!< Falling trigger event configuration bit of line 5 */
#define EXTI1_FTSR1_FT6_Pos         (6U)
#define EXTI1_FTSR1_FT6_Msk         (0x1UL << EXTI1_FTSR1_FT6_Pos)                /*!< 0x00000040 */
#define EXTI1_FTSR1_FT6             EXTI1_FTSR1_FT6_Msk                          /*!< Falling trigger event configuration bit of line 6 */
#define EXTI1_FTSR1_FT7_Pos         (7U)
#define EXTI1_FTSR1_FT7_Msk         (0x1UL << EXTI1_FTSR1_FT7_Pos)                /*!< 0x00000080 */
#define EXTI1_FTSR1_FT7             EXTI1_FTSR1_FT7_Msk                          /*!< Falling trigger event configuration bit of line 7 */
#define EXTI1_FTSR1_FT8_Pos         (8U)
#define EXTI1_FTSR1_FT8_Msk         (0x1UL << EXTI1_FTSR1_FT8_Pos)                /*!< 0x00000100 */
#define EXTI1_FTSR1_FT8             EXTI1_FTSR1_FT8_Msk                          /*!< Falling trigger event configuration bit of line 8 */
#define EXTI1_FTSR1_FT9_Pos         (9U)
#define EXTI1_FTSR1_FT9_Msk         (0x1UL << EXTI1_FTSR1_FT9_Pos)                /*!< 0x00000200 */
#define EXTI1_FTSR1_FT9             EXTI1_FTSR1_FT9_Msk                          /*!< Falling trigger event configuration bit of line 9 */
#define EXTI1_FTSR1_FT10_Pos        (10U)
#define EXTI1_FTSR1_FT10_Msk        (0x1UL << EXTI1_FTSR1_FT10_Pos)               /*!< 0x00000400 */
#define EXTI1_FTSR1_FT10            EXTI1_FTSR1_FT10_Msk                         /*!< Falling trigger event configuration bit of line 10 */
#define EXTI1_FTSR1_FT11_Pos        (11U)
#define EXTI1_FTSR1_FT11_Msk        (0x1UL << EXTI1_FTSR1_FT11_Pos)               /*!< 0x00000800 */
#define EXTI1_FTSR1_FT11            EXTI1_FTSR1_FT11_Msk                         /*!< Falling trigger event configuration bit of line 11 */
#define EXTI1_FTSR1_FT12_Pos        (12U)
#define EXTI1_FTSR1_FT12_Msk        (0x1UL << EXTI1_FTSR1_FT12_Pos)               /*!< 0x00001000 */
#define EXTI1_FTSR1_FT12            EXTI1_FTSR1_FT12_Msk                         /*!< Falling trigger event configuration bit of line 12 */
#define EXTI1_FTSR1_FT13_Pos        (13U)
#define EXTI1_FTSR1_FT13_Msk        (0x1UL << EXTI1_FTSR1_FT13_Pos)               /*!< 0x00002000 */
#define EXTI1_FTSR1_FT13            EXTI1_FTSR1_FT13_Msk                         /*!< Falling trigger event configuration bit of line 13 */
#define EXTI1_FTSR1_FT14_Pos        (14U)
#define EXTI1_FTSR1_FT14_Msk        (0x1UL << EXTI1_FTSR1_FT14_Pos)               /*!< 0x00004000 */
#define EXTI1_FTSR1_FT14            EXTI1_FTSR1_FT14_Msk                         /*!< Falling trigger event configuration bit of line 14 */
#define EXTI1_FTSR1_FT15_Pos        (15U)
#define EXTI1_FTSR1_FT15_Msk        (0x1UL << EXTI1_FTSR1_FT15_Pos)               /*!< 0x00008000 */
#define EXTI1_FTSR1_FT15            EXTI1_FTSR1_FT15_Msk                         /*!< Falling trigger event configuration bit of line 15 */
#define EXTI1_FTSR1_FT16_Pos        (16U)
#define EXTI1_FTSR1_FT16_Msk        (0x1UL << EXTI1_FTSR1_FT16_Pos)               /*!< 0x00010000 */
#define EXTI1_FTSR1_FT16            EXTI1_FTSR1_FT16_Msk                         /*!< Falling trigger event configuration bit of line 16 */
#define EXTI1_FTSR1_FT17_Pos        (17U)
#define EXTI1_FTSR1_FT17_Msk        (0x1UL << EXTI1_FTSR1_FT17_Pos)               /*!< 0x00020000 */
#define EXTI1_FTSR1_FT17            EXTI1_FTSR1_FT17_Msk                         /*!< Falling trigger event configuration bit of line 17 */
#define EXTI1_FTSR1_FT18_Pos        (18U)
#define EXTI1_FTSR1_FT18_Msk        (0x1UL << EXTI1_FTSR1_FT18_Pos)               /*!< 0x00040000 */
#define EXTI1_FTSR1_FT18            EXTI1_FTSR1_FT18_Msk                         /*!< Falling trigger event configuration bit of line 18 */

